tangyangguang/Esp32_Irrigation/上一版/V6/待删除/2026-06-29-历史过程文件/历史归档/2026-06-29-process-cleanup/legacy-worktrees/worktrees/two-flow-six-zone-implementation/src/web/IrrigationWeb.cpp
void writeRecordJson(const RecordStore::WateringRecord& record) {
    Esp32BaseWeb::sendChunk("{\"recordId\":");
    writeUInt(record.recordId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(record.zoneId);
    Esp32BaseWeb::sendChunk(",\"flowId\":");
    writeUInt(record.configSnapshot.flowId);
    Esp32BaseWeb::sendChunk(",\"taskType\":");
    writeUInt(record.taskType);
    Esp32BaseWeb::sendChunk(",\"startSource\":");
    writeUInt(record.startSource);
    Esp32BaseWeb::sendChunk(",\"stopSource\":");
    writeUInt(record.stopSource);
    Esp32BaseWeb::sendChunk(",\"result\":");
    writeUInt(record.result);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(record.planId);
    Esp32BaseWeb::sendChunk(",\"planName\":\"");
    Esp32BaseWeb::writeJsonEscaped(record.planNameSnapshot);
    Esp32BaseWeb::sendChunk("\",\"targetSec\":");
    writeUInt(record.targetSec);
    Esp32BaseWeb::sendChunk(",\"startedEpoch\":");
    writeUInt(record.startedEpoch);
    Esp32BaseWeb::sendChunk(",\"endedEpoch\":");
    writeUInt(record.endedEpoch);
    Esp32BaseWeb::sendChunk(",\"estimatedMilliliters\":");
    writeUInt(record.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(",\"maxFlowMlPerMin\":");
    writeUInt(record.maxFlowMlPerMin);
    Esp32BaseWeb::sendChunk(",\"minFlowMlPerMin\":");
    writeUInt(record.minFlowMlPerMin);
    Esp32BaseWeb::sendChunk("}");
}

void writeEventJson(const Esp32BaseAppEventRecord& event) {
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk(",\"level\":");
    writeUInt(event.level);
    Esp32BaseWeb::sendChunk(",\"epochSec\":");
    writeUInt(event.epochSec);
    Esp32BaseWeb::sendChunk(",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.source);
    Esp32BaseWeb::sendChunk("\",\"type\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.type);
    Esp32BaseWeb::sendChunk("\",\"reason\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.reason);
    Esp32BaseWeb::sendChunk("\",\"object\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.object);
    Esp32BaseWeb::sendChunk("\",\"code\":");
    writeUInt(event.code);
    Esp32BaseWeb::sendChunk(",\"value1\":");
    writeInt(event.value1);
    Esp32BaseWeb::sendChunk(",\"value2\":");
    writeInt(event.value2);
    Esp32BaseWeb::sendChunk(",\"value3\":");
    writeInt(event.value3);
    Esp32BaseWeb::sendChunk(",\"text\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.text);
    Esp32BaseWeb::sendChunk("\"}");
}

void writeStatusJson(const Irrigation::ZoneStatus& status) {
    Esp32BaseWeb::sendChunk("{\"zoneId\":");
    writeUInt(status.zoneId);
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::zoneStateName(status.state));
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(status.enabled);
    Esp32BaseWeb::sendChunk(",\"busy\":");
    writeBool(status.busy);
    const char* reason = ZoneManager::blockedReason(status.zoneId);
    Esp32BaseWeb::sendChunk(",\"canStart\":");
    writeBool(reason && strcmp(reason, "none") == 0);
    Esp32BaseWeb::sendChunk(",\"blockedReason\":\"");
    Esp32BaseWeb::writeJsonEscaped(reason ? reason : "unknown");
    Esp32BaseWeb::sendChunk("\"");
    Esp32BaseWeb::sendChunk(",\"errorActive\":");
    writeBool(status.errorActive);
    Esp32BaseWeb::sendChunk(",\"errorCode\":");
    writeUInt(static_cast<uint8_t>(status.errorCode));
    Esp32BaseWeb::sendChunk(",\"targetSec\":");
    writeUInt(status.targetSec);
    Esp32BaseWeb::sendChunk(",\"elapsedSec\":");
    writeUInt(status.elapsedSec);
    Esp32BaseWeb::sendChunk(",\"remainingSec\":");
    writeUInt(status.remainingSec);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    writeUInt(status.pulses);
    Esp32BaseWeb::sendChunk(",\"estimatedMilliliters\":");
    writeUInt(status.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(",\"flowMlPerMin\":");
    writeUInt(status.flowMlPerMin);
    Esp32BaseWeb::sendChunk(",\"flowRateReady\":");
    writeBool(status.flowRateReady);
    Esp32BaseWeb::sendChunk("}");
}

void handleIndexPage() {
    Esp32BaseWeb::sendHeader("灌溉控制");
    Esp32BaseWeb::sendPageTitle("ESP32 灌溉控制", "2 个流量计，最多 6 路水路");
    Esp32BaseWeb::beginPanel("水路状态");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table><thead><tr><th>水路</th><th>状态</th><th>Flow</th><th>流量</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& config = ZoneConfigStore::get(zoneId);
        if (!config.enabled) {
            continue;
        }
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(config.name);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(Irrigation::zoneStateName(status.state));
        Esp32BaseWeb::sendChunk("</td><td>Flow ");
        writeUInt(config.flowId);
        Esp32BaseWeb::sendChunk("</td><td>");
        writeUInt(status.flowMlPerMin);
        Esp32BaseWeb::sendChunk(" ml/min</td><td><form method='post' action='/api/v1/manual/start' onsubmit=\"return confirm('确认启动该水路手动浇水？')\"><input type='hidden' name='zoneId' value='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'><input type='hidden' name='durationSec' value='");
        writeUInt(SystemConfigStore::current().manualDefaultDurationSec);
        Esp32BaseWeb::sendChunk("'><input type='submit' value='启动'></form><form method='post' action='/api/v1/manual/stop' onsubmit=\"return confirm('确认停止该水路？')\"><input type='hidden' name='zoneId' value='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'><input type='submit' value='停止'></form></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div><form method='post' action='/api/v1/manual/stop-all' onsubmit=\"return confirm('确认停止全部水路？')\"><input type='submit' value='全部停止'></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void writeChecked(bool checked) {
    if (checked) {
        Esp32BaseWeb::sendChunk(" checked");
    }
}

void writeNumberInput(const char* name, int32_t value) {
    Esp32BaseWeb::sendChunk("<input name='");
    Esp32BaseWeb::sendChunk(name);
    Esp32BaseWeb::sendChunk("' type='number' value='");
    writeInt(value);
    Esp32BaseWeb::sendChunk("'>");
}

