tangyangguang/Esp32_Irrigation/上一版/V6/待删除/2026-06-29-历史过程文件/历史归档/2026-06-29-process-cleanup/legacy-worktrees/worktrees/two-flow-six-zone-implementation/src/web/IrrigationWeb.cpp
void handleFlowsPage() {
    Esp32BaseWeb::sendHeader("Flows");
    Esp32BaseWeb::sendPageTitle("Flows", "流量计配置与 K+Offset 校准参数");
    Esp32BaseWeb::beginPanel("Flow 配置");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table><thead><tr><th>Flow</th><th>GPIO</th><th>状态</th><th>Active</th><th>Pending</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t flowId = 1; flowId <= Irrigation::MaxFlowMeters; ++flowId) {
        const Irrigation::FlowMeterConfig& flow = FlowConfigStore::get(flowId);
        const Irrigation::FlowMeterCalibrationProfile& active = flow.activeCalibration;
        Esp32BaseWeb::sendChunk("<tr><td>Flow ");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk("</td><td>GPIO ");
        writeUInt(flow.pulsePin);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::sendChunk(flow.enabled ? "enabled" : "disabled");
        Esp32BaseWeb::sendChunk("</td><td>K=");
        writeInt(active.kUlPerMinPerHz);
        Esp32BaseWeb::sendChunk(" offset=");
        writeInt(active.offsetMilliHz);
        Esp32BaseWeb::sendChunk("</td><td>");
        if (flow.hasPendingCalibration) {
            Esp32BaseWeb::sendChunk("K=");
            writeInt(flow.pendingCalibration.kUlPerMinPerHz);
            Esp32BaseWeb::sendChunk(" offset=");
            writeInt(flow.pendingCalibration.offsetMilliHz);
        } else {
            Esp32BaseWeb::sendChunk("-");
        }
        Esp32BaseWeb::sendChunk("</td><td><form method='post' action='/api/v1/flows/config' onsubmit=\"return confirm('确认保存 Flow 配置？')\"><input type='hidden' name='flowId' value='");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk("'><input type='hidden' name='enabledPresent' value='1'><label><input type='checkbox' name='enabled' value='1'");
        writeChecked(flow.enabled);
        Esp32BaseWeb::sendChunk(">启用</label><br>K ");
        writeNumberInput("kUlPerMinPerHz", active.kUlPerMinPerHz);
        Esp32BaseWeb::sendChunk("<br>Offset ");
        writeNumberInput("offsetMilliHz", active.offsetMilliHz);
        Esp32BaseWeb::sendChunk("<br>Min Hz(milli) ");
        writeNumberInput("minValidFreqMilliHz", static_cast<int32_t>(active.minValidFreqMilliHz));
        Esp32BaseWeb::sendChunk("<br><input type='submit' value='保存为 pending'></form><form method='post' action='/api/v1/calibration/pending/apply' onsubmit=\"return confirm('确认应用 pending 校准？')\"><input type='hidden' name='flowId' value='");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk("'><input type='submit' value='应用 pending'></form><form method='post' action='/api/v1/calibration/rollback/restore' onsubmit=\"return confirm('确认回滚上一套校准？')\"><input type='hidden' name='flowId' value='");
        writeUInt(flowId);
        Esp32BaseWeb::sendChunk("'><input type='submit' value='回滚'></form></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleZonesPage() {
    Esp32BaseWeb::sendHeader("Zones");
    Esp32BaseWeb::sendPageTitle("Zones", "6 路水路配置");
    Esp32BaseWeb::beginPanel("Zone 配置");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table><thead><tr><th>Zone</th><th>阀门</th><th>Flow</th><th>状态</th><th>配置</th></tr></thead><tbody>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneConfigStore::get(zoneId);
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</td><td>GPIO ");
        writeUInt(zone.valvePin);
        Esp32BaseWeb::sendChunk("</td><td>Flow ");
        writeUInt(zone.flowId);
        Esp32BaseWeb::sendChunk("</td><td>");
        Esp32BaseWeb::writeHtmlEscaped(Irrigation::zoneStateName(status.state));
        Esp32BaseWeb::sendChunk("</td><td><form method='post' action='/api/v1/zones/config' onsubmit=\"return confirm('确认保存 Zone 配置？')\"><input type='hidden' name='zoneId' value='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'><input type='hidden' name='enabledPresent' value='1'>名称 <input name='name' maxlength='31' value='");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("'><br><label><input type='checkbox' name='enabled' value='1'");
        writeChecked(zone.enabled);
        Esp32BaseWeb::sendChunk(">启用</label><br>Flow ");
        writeNumberInput("flowId", zone.flowId);
        Esp32BaseWeb::sendChunk("<br><input type='submit' value='保存基础配置'></form><form method='post' action='/api/v1/zones/baseline/pending/save' onsubmit=\"return confirm('确认保存 Zone 基线为 pending？')\"><input type='hidden' name='zoneId' value='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>正常 ml/min ");
        writeNumberInput("learnedFlowMlPerMin", static_cast<int32_t>(zone.activeBaseline.learnedFlowMlPerMin));
        Esp32BaseWeb::sendChunk("<br>低阈值 permille ");
        writeNumberInput("lowFlowPermille", zone.activeBaseline.lowFlowPermille);
        Esp32BaseWeb::sendChunk("<br>高阈值 permille ");
        writeNumberInput("highFlowPermille", zone.activeBaseline.highFlowPermille);
        Esp32BaseWeb::sendChunk("<br>确认秒 ");
        writeNumberInput("flowFaultConfirmSec", zone.activeBaseline.flowFaultConfirmSec);
        Esp32BaseWeb::sendChunk("<br>无脉冲秒 ");
        writeNumberInput("noPulseTimeoutSec", zone.activeBaseline.noPulseTimeoutSec);
        Esp32BaseWeb::sendChunk("<br><input type='submit' value='保存基线 pending'></form><form method='post' action='/api/v1/zones/baseline/pending/apply' onsubmit=\"return confirm('确认应用 pending 基线？')\"><input type='hidden' name='zoneId' value='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'><input type='submit' value='应用 pending'></form><form method='post' action='/api/v1/zones/baseline/rollback/restore' onsubmit=\"return confirm('确认回滚上一套基线？')\"><input type='hidden' name='zoneId' value='");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'><input type='submit' value='回滚'></form></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleCalibrationPage() {
    Esp32BaseWeb::sendHeader("Calibration");
    Esp32BaseWeb::sendPageTitle("Calibration", "Flow K+Offset 校准");
    Esp32BaseWeb::beginPanel("采样");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/calibration/start' onsubmit=\"return confirm('确认开始校准采样？')\">Zone ");
    writeNumberInput("zoneId", 1);
    Esp32BaseWeb::sendChunk("<input type='submit' value='开始采样'></form><form method='post' action='/api/v1/calibration/stop' onsubmit=\"return confirm('确认停止采样？')\"><input type='submit' value='停止采样'></form><form method='post' action='/api/v1/calibration/sample' onsubmit=\"return confirm('确认提交实际接水量？')\">实际 ml ");
    writeNumberInput("actualMl", 1000);
    Esp32BaseWeb::sendChunk("<input type='submit' value='提交样本'></form><form method='post' action='/api/v1/calibration/pending/save' onsubmit=\"return confirm('确认保存推荐值为 pending？')\"><input type='submit' value='保存推荐 pending'></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handleSettingsPage() {
    const Irrigation::SystemConfig& config = SystemConfigStore::current();
    Esp32BaseWeb::sendHeader("Settings");
    Esp32BaseWeb::sendPageTitle("Settings", "灌溉系统参数");
    Esp32BaseWeb::beginPanel("系统配置");
    Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/config' onsubmit=\"return confirm('确认保存系统配置？')\">最长秒 ");
    writeNumberInput("maxWateringDurationSec", static_cast<int32_t>(config.maxWateringDurationSec));
    Esp32BaseWeb::sendChunk("<br>手动默认秒 ");
    writeNumberInput("manualDefaultDurationSec", static_cast<int32_t>(config.manualDefaultDurationSec));
    Esp32BaseWeb::sendChunk("<br>计划宽限秒 ");
    writeNumberInput("scheduleGraceSec", config.scheduleGraceSec);
    Esp32BaseWeb::sendChunk("<br>排队最大秒 ");
    writeNumberInput("queuedPlanMaxDelaySec", config.queuedPlanMaxDelaySec);
    Esp32BaseWeb::sendChunk("<br>待机漏水窗口秒 ");
    writeNumberInput("idleLeakWindowSec", config.idleLeakWindowSec);
    Esp32BaseWeb::sendChunk("<br>待机漏水脉冲 ");
    writeNumberInput("idleLeakPulseThreshold", config.idleLeakPulseThreshold);
    Esp32BaseWeb::sendChunk("<br><input type='submit' value='保存'></form>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

void handlePlansPage() {
    uint32_t defaultYmd = 20260605UL;
    (void)PlanStore::currentYmd(&defaultYmd);
    Esp32BaseWeb::sendHeader("Plans");
    Esp32BaseWeb::sendPageTitle("Plans", "每个 Zone 最多 6 条计划");
    Esp32BaseWeb::beginPanel("计划");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table><thead><tr><th>Zone</th><th>Slot</th><th>计划</th><th>启用</th><th>时间</th><th>时长</th><th>循环</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            Esp32BaseWeb::sendChunk("<tr><td>Zone ");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("</td><td>");
            writeUInt(slot + 1);
            Esp32BaseWeb::sendChunk("</td><td>");
            if (plan.exists) {
                Esp32BaseWeb::writeHtmlEscaped(plan.name);
            } else {
                Esp32BaseWeb::sendChunk("-");
            }
            Esp32BaseWeb::sendChunk("</td><td>");
            Esp32BaseWeb::sendChunk(plan.exists && plan.enabled ? "yes" : "no");
            Esp32BaseWeb::sendChunk("</td><td>");
            if (plan.exists) {
                writeUInt(plan.timeHour);
                Esp32BaseWeb::sendChunk(":");
                if (plan.timeMinute < 10) {
                    Esp32BaseWeb::sendChunk("0");
                }
                writeUInt(plan.timeMinute);
            } else {
                Esp32BaseWeb::sendChunk("-");
            }
            Esp32BaseWeb::sendChunk("</td><td>");
            writeUInt(plan.exists ? plan.durationSec : 300);
            Esp32BaseWeb::sendChunk(" s</td><td>");
            writeUInt(plan.exists ? plan.cycleDays : 1);
            Esp32BaseWeb::sendChunk(" d</td><td><form method='post' action='/api/v1/plans/save' onsubmit=\"return confirm('确认保存计划？')\">");
            if (plan.exists) {
                Esp32BaseWeb::sendChunk("<input type='hidden' name='planId' value='");
                writeUInt(plan.planId);
                Esp32BaseWeb::sendChunk("'>");
            }
            Esp32BaseWeb::sendChunk("<input type='hidden' name='zoneId' value='");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("'><input type='hidden' name='enabledPresent' value='1'>名称 <input name='name' maxlength='31' value='");
            if (plan.exists) {
                Esp32BaseWeb::writeHtmlEscaped(plan.name);
            } else {
                Esp32BaseWeb::sendChunk("计划");
            }
            Esp32BaseWeb::sendChunk("'><br><label><input type='checkbox' name='enabled' value='1'");
            writeChecked(plan.exists && plan.enabled);
            Esp32BaseWeb::sendChunk(">启用</label><br>时 ");
            writeNumberInput("timeHour", plan.exists ? plan.timeHour : 7);
            Esp32BaseWeb::sendChunk(" 分 ");
            writeNumberInput("timeMinute", plan.exists ? plan.timeMinute : 0);
            Esp32BaseWeb::sendChunk("<br>时长秒 ");
            writeNumberInput("durationSec", plan.exists ? static_cast<int32_t>(plan.durationSec) : 300);
            Esp32BaseWeb::sendChunk("<br>循环天 ");
            writeNumberInput("cycleDays", plan.exists ? plan.cycleDays : 1);
            Esp32BaseWeb::sendChunk("<br>循环掩码 ");
            writeNumberInput("cycleMask", plan.exists ? static_cast<int32_t>(plan.cycleMask) : 1);
            Esp32BaseWeb::sendChunk("<br>起始日期 ");
            writeNumberInput("cycleStartYmd", plan.exists ? static_cast<int32_t>(plan.cycleStartYmd) : static_cast<int32_t>(defaultYmd));
            Esp32BaseWeb::sendChunk("<br><input type='submit' value='保存'></form>");
            if (plan.exists) {
                Esp32BaseWeb::sendChunk("<form method='post' action='/api/v1/plans/delete' onsubmit=\"return confirm('确认删除计划？')\"><input type='hidden' name='planId' value='");
                writeUInt(plan.planId);
                Esp32BaseWeb::sendChunk("'><input type='submit' value='删除'></form>");
            }
            Esp32BaseWeb::sendChunk("</td></tr>");
        }
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    Esp32BaseWeb::sendFooter();
}

struct RecordJsonState {
    bool first;
};

