tangyangguang/Esp32_Irrigation/上一版/V6/待删除/2026-06-29-历史过程文件/历史归档/2026-06-29-process-cleanup/legacy-worktrees/worktrees/two-flow-six-zone-implementation/src/web/IrrigationWeb.cpp
void sendEventJsonCallback(const Esp32BaseAppEventRecord& event, void* user) {
    if (strncmp(event.object, "zone:", 5) != 0 &&
        strncmp(event.object, "flow:", 5) != 0 &&
        strncmp(event.object, "plan:", 5) != 0 &&
        strncmp(event.object, "system:irrigation", 17) != 0 &&
        strncmp(event.object, "config:", 7) != 0) {
        return;
    }
    EventJsonState* state = static_cast<EventJsonState*>(user);
    if (!state->first) {
        Esp32BaseWeb::sendChunk(",");
    }
    state->first = false;
    writeEventJson(event);
}

void handleEventsApi() {
    EventJsonState state = {true};
    Esp32BaseWeb::beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"count\":");
    writeUInt(Esp32BaseAppEventLog::count());
    Esp32BaseWeb::sendChunk(",\"events\":[");
    (void)Esp32BaseAppEventLog::readLatest(0, 80, sendEventJsonCallback, &state);
    Esp32BaseWeb::sendChunk("]}");
    Esp32BaseWeb::endJson();
}

void handleManualStartApi() {
    uint8_t zoneId = 0;
    uint32_t durationSec = 0;
    if (!readZoneId(&zoneId) || !readU32("durationSec", &durationSec)) {
        sendError(400, "invalid_manual_start");
        return;
    }
    if (!ZoneManager::startManual(zoneId, durationSec, Irrigation::StartSource::WEB_PAGE)) {
        sendError(409, "manual_start_rejected");
        return;
    }
    sendOk();
}

void handleManualStopApi() {
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone_id");
        return;
    }
    if (!ZoneManager::stopZone(zoneId, Irrigation::StopSource::WEB_PAGE, Irrigation::TaskResult::USER_STOPPED)) {
        sendError(409, "manual_stop_rejected");
        return;
    }
    sendOk();
}

void handleStopAllApi() {
    const uint8_t stopped = ZoneManager::stopAll(Irrigation::StopSource::WEB_PAGE, Irrigation::TaskResult::USER_STOPPED);
    Esp32BaseWeb::beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"stopped\":");
    writeUInt(stopped);
    Esp32BaseWeb::sendChunk("}");
    Esp32BaseWeb::endJson();
}

void handleZoneConfigApi() {
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone_id");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_running");
        return;
    }
    Irrigation::ZoneConfig config = ZoneConfigStore::get(zoneId);
    if (Esp32BaseWeb::hasParam("name")) {
        char name[Irrigation::NameMaxBytes];
        if (!getParamText("name", name, sizeof(name))) {
            sendError(400, "invalid_name");
            return;
        }
        strlcpy(config.name, name, sizeof(config.name));
    }
    if (Esp32BaseWeb::hasParam("enabledPresent") || Esp32BaseWeb::hasParam("enabled")) {
        config.enabled = readCheckbox("enabled");
    }
    if (Esp32BaseWeb::hasParam("flowId") && !readU8("flowId", &config.flowId)) {
        sendError(400, "invalid_flow_id");
        return;
    }
    if (config.enabled && !FlowConfigStore::get(config.flowId).enabled) {
        sendError(409, "flow_disabled");
        return;
    }
    if (!ZoneConfigStore::set(zoneId, config)) {
        sendError(400, "zone_config_rejected");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    sendOk();
}

void handleZoneBaselineSavePendingApi() {
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone_id");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_running");
        return;
    }
    Irrigation::ZoneFlowBaselineProfile pending = ZoneConfigStore::get(zoneId).hasPendingBaseline
        ? ZoneConfigStore::get(zoneId).pendingBaseline
        : ZoneConfigStore::get(zoneId).activeBaseline;
    if (Esp32BaseWeb::hasParam("learnedFlowMlPerMin") && !readU32("learnedFlowMlPerMin", &pending.learnedFlowMlPerMin)) {
        sendError(400, "invalid_learned_flow");
        return;
    }
    if (Esp32BaseWeb::hasParam("lowFlowPermille") && !readU16("lowFlowPermille", &pending.lowFlowPermille)) {
        sendError(400, "invalid_low_flow");
        return;
    }
    if (Esp32BaseWeb::hasParam("highFlowPermille") && !readU16("highFlowPermille", &pending.highFlowPermille)) {
        sendError(400, "invalid_high_flow");
        return;
    }
    if (Esp32BaseWeb::hasParam("flowFaultConfirmSec") && !readU16("flowFaultConfirmSec", &pending.flowFaultConfirmSec)) {
        sendError(400, "invalid_fault_confirm");
        return;
    }
    if (Esp32BaseWeb::hasParam("noPulseTimeoutSec") && !readU16("noPulseTimeoutSec", &pending.noPulseTimeoutSec)) {
        sendError(400, "invalid_no_pulse_timeout");
        return;
    }
    pending.source = pending.learnedFlowMlPerMin > 0 ? Irrigation::ParameterSource::MANUAL : Irrigation::ParameterSource::NONE;
    pending.updatedAt = ZoneManager::trustedEpoch();
    if (!ZoneConfigStore::savePendingBaseline(zoneId, pending)) {
        sendError(400, "pending_baseline_rejected");
        return;
    }
    sendOk();
}

void handleZoneBaselineApplyApi() {
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone_id");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_running");
        return;
    }
    Irrigation::ZoneFlowBaselineProfile oldProfile = {};
    Irrigation::ZoneFlowBaselineProfile newProfile = {};
    if (!ZoneConfigStore::applyPendingBaseline(zoneId, &oldProfile, &newProfile)) {
        sendError(409, "apply_baseline_failed");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    BusinessEventLog::appendZoneBaselineApplied(zoneId, oldProfile, newProfile, "web");
    sendOk();
}

void handleZoneBaselineRestoreApi() {
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone_id");
        return;
    }
    if (ZoneManager::isZoneBusy(zoneId)) {
        sendError(409, "zone_running");
        return;
    }
    Irrigation::ZoneFlowBaselineProfile oldProfile = {};
    Irrigation::ZoneFlowBaselineProfile restoredProfile = {};
    if (!ZoneConfigStore::restoreRollbackBaseline(zoneId, &oldProfile, &restoredProfile)) {
        sendError(409, "restore_baseline_failed");
        return;
    }
    (void)ZoneManager::reloadZone(zoneId);
    BusinessEventLog::appendZoneBaselineRestored(zoneId, oldProfile, restoredProfile, "web");
    sendOk();
}

void handleFlowConfigApi() {
    uint8_t flowId = 0;
    if (!readFlowId(&flowId)) {
        sendError(400, "invalid_flow_id");
        return;
    }
    Irrigation::FlowMeterConfig config = FlowConfigStore::get(flowId);
    const bool enabledSubmitted = Esp32BaseWeb::hasParam("enabledPresent") || Esp32BaseWeb::hasParam("enabled");
    bool requestedEnabled = config.enabled;
    if (enabledSubmitted) {
        requestedEnabled = readCheckbox("enabled");
        config.enabled = requestedEnabled;
        if (!requestedEnabled && flowHasEnabledZones(flowId)) {
            sendError(409, "flow_has_enabled_zones");
            return;
        }
    }
    bool calibrationChanged = false;
    Irrigation::FlowMeterCalibrationProfile pending = config.hasPendingCalibration
        ? config.pendingCalibration
        : config.activeCalibration;
    if (Esp32BaseWeb::hasParam("kUlPerMinPerHz") && !readI32("kUlPerMinPerHz", &config.activeCalibration.kUlPerMinPerHz)) {
        sendError(400, "invalid_k");
        return;
    }
    if (Esp32BaseWeb::hasParam("offsetMilliHz") && !readI32("offsetMilliHz", &config.activeCalibration.offsetMilliHz)) {
        sendError(400, "invalid_offset");
        return;
    }
    if (Esp32BaseWeb::hasParam("warningFreqMilliHz") && !readU32("warningFreqMilliHz", &config.activeCalibration.warningFreqMilliHz)) {
        sendError(400, "invalid_warning_freq");
        return;
    }
    if (Esp32BaseWeb::hasParam("minValidFreqMilliHz") && !readU32("minValidFreqMilliHz", &config.activeCalibration.minValidFreqMilliHz)) {
        sendError(400, "invalid_min_freq");
        return;
    }
    if (Esp32BaseWeb::hasParam("maxValidFreqMilliHz") && !readU32("maxValidFreqMilliHz", &config.activeCalibration.maxValidFreqMilliHz)) {
        sendError(400, "invalid_max_freq");
        return;
    }
    if (Esp32BaseWeb::hasParam("pressurizeSec") && !readU16("pressurizeSec", &config.activeCalibration.pressurizeSec)) {
        sendError(400, "invalid_pressurize");
        return;
    }
    if (Esp32BaseWeb::hasParam("sampleWindowSec") && !readU16("sampleWindowSec", &config.activeCalibration.sampleWindowSec)) {
        sendError(400, "invalid_sample_window");
        return;
    }
    if (Esp32BaseWeb::hasParam("kUlPerMinPerHz")) {
        pending.kUlPerMinPerHz = config.activeCalibration.kUlPerMinPerHz;
        calibrationChanged = true;
    }
    if (Esp32BaseWeb::hasParam("offsetMilliHz")) {
        pending.offsetMilliHz = config.activeCalibration.offsetMilliHz;
        calibrationChanged = true;
    }
    if (Esp32BaseWeb::hasParam("warningFreqMilliHz")) {
        pending.warningFreqMilliHz = config.activeCalibration.warningFreqMilliHz;
        calibrationChanged = true;
    }
    if (Esp32BaseWeb::hasParam("minValidFreqMilliHz")) {
        pending.minValidFreqMilliHz = config.activeCalibration.minValidFreqMilliHz;
        calibrationChanged = true;
    }
    if (Esp32BaseWeb::hasParam("maxValidFreqMilliHz")) {
        pending.maxValidFreqMilliHz = config.activeCalibration.maxValidFreqMilliHz;
        calibrationChanged = true;
    }
    if (Esp32BaseWeb::hasParam("pressurizeSec")) {
        pending.pressurizeSec = config.activeCalibration.pressurizeSec;
        calibrationChanged = true;
    }
    if (Esp32BaseWeb::hasParam("sampleWindowSec")) {
        pending.sampleWindowSec = config.activeCalibration.sampleWindowSec;
        calibrationChanged = true;
    }
    if (calibrationChanged) {
        pending.source = Irrigation::ParameterSource::MANUAL;
        if (!FlowConfigStore::savePendingCalibration(flowId, pending)) {
            sendError(400, "pending_calibration_rejected");
            return;
        }
        config = FlowConfigStore::get(flowId);
        if (enabledSubmitted) {
            config.enabled = requestedEnabled;
        }
    }
    if (!FlowConfigStore::set(flowId, config)) {
        sendError(400, "flow_config_rejected");
        return;
    }
    sendOk();
}

void handleCalibrationStartApi() {
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone_id");
        return;
    }
    if (!FlowCalibration::start(zoneId, SystemConfigStore::current())) {
        sendError(409, FlowCalibration::lastError());
        return;
    }
    sendOk();
}

